Revit 2024 API
BuiltInFailures.StairRampFailures.StairsCannotExtendToFloorStructureLayerWarning Property
 Stairs cannot extend to floor structure layer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairsCannotExtendToFloorStructureLayerWarning { get; }
Visual Basic
Public Shared ReadOnly Property StairsCannotExtendToFloorStructureLayerWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairsCannotExtendToFloorStructureLayerWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace